OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_hal_esmc.h
/**
  ******************************************************************************
  * @file    py32f4xx_hal_esmc.h
  * @author  MCU Application Team
  * @brief   Header file of ESMC HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32F4xx_HAL_ESMC_H
#define __PY32F4xx_HAL_ESMC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f4xx_hal_def.h"

/** @addtogroup PY32F4xx_HAL_Driver
  * @{
  */

/** @addtogroup ESMC
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup ESMC_Exported_Types ESMC Exported Types
  * @{
  */

/**
  * @brief  ESMC Init structure definition
  */

typedef struct
{
  uint32_t ClockPrescaler;     /* Specifies the prescaler factor for generating clock based on the AHB clock.
                                  This parameter can be a number between 2 and 255 */

  uint32_t ClockMode;          /* Specifies the Clock Mode. It indicates the level that clock takes between commands.
                                  This parameter can be a value of @ref ESMC_ClockMode */

  uint32_t DualFlash;          /* Specifies the Dual Flash Mode State
                                  This parameter can be a value of @ref ESMC_DualFlash_Mode */

} ESMC_InitTypeDef;

/**
  * @brief HAL ESMC State structures definition
  */
typedef enum
{
  HAL_ESMC_STATE_RESET             = 0x00U,    /*!< Peripheral not initialized                            */
  HAL_ESMC_STATE_READY             = 0x01U,    /*!< Peripheral initialized and ready for use              */
  HAL_ESMC_STATE_BUSY              = 0x02U,    /*!< Peripheral in indirect mode and busy                  */
  HAL_ESMC_STATE_BUSY_INDIRECT_TX  = 0x12U,    /*!< Peripheral in indirect mode with transmission ongoing */
  HAL_ESMC_STATE_BUSY_INDIRECT_RX  = 0x22U,    /*!< Peripheral in indirect mode with reception ongoing    */
  HAL_ESMC_STATE_BUSY_AUTO_POLLING = 0x42U,    /*!< Peripheral in auto polling mode ongoing               */
  HAL_ESMC_STATE_BUSY_MEM_MAPPED   = 0x82U,    /*!< Peripheral in memory mapped mode ongoing              */
  HAL_ESMC_STATE_ABORT             = 0x08U,    /*!< Peripheral with abort request ongoing                 */
  HAL_ESMC_STATE_ERROR             = 0x04U     /*!< Peripheral in error                                   */
} HAL_ESMC_StateTypeDef;

/**
  * @brief  ESMC Handle Structure definition
  */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
typedef struct __ESMC_HandleTypeDef
#else
typedef struct
#endif
{
  ESMC_TypeDef               *Instance;        /* ESMC registers base address        */
  ESMC_InitTypeDef           Init;             /* ESMC communication parameters      */
  uint8_t                    *pTxBuffPtr;      /* Pointer to ESMC Tx transfer Buffer */
  __IO uint32_t              TxXferSize;       /* ESMC Tx Transfer size              */
  __IO uint32_t              TxXferCount;      /* ESMC Tx Transfer Counter           */
  uint8_t                    *pRxBuffPtr;      /* Pointer to ESMC Rx transfer Buffer */
  __IO uint32_t              RxXferSize;       /* ESMC Rx Transfer size              */
  __IO uint32_t              RxXferCount;      /* ESMC Rx Transfer Counter           */
  DMA_HandleTypeDef          *hdmarx;          /* ESMC Rx DMA Handle parameters      */
  DMA_HandleTypeDef          *hdmatx;          /* ESMC Tx DMA Handle parameters      */
  __IO HAL_LockTypeDef       Lock;             /* Locking object                     */
  __IO HAL_ESMC_StateTypeDef State;            /* ESMC communication state           */
  __IO uint32_t              ErrorCode;        /* ESMC Error code                    */
  uint32_t                   Timeout;          /* Timeout for the ESMC memory access */
  uint32_t                   Contex;           /* ESMC transfer context */
  uint32_t                   ContexAddr24;     /* Temporarily store the value of register ADDR24 */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
  void (* ErrorCallback)        (struct __ESMC_HandleTypeDef *hesmc);
  void (* AbortCpltCallback)    (struct __ESMC_HandleTypeDef *hesmc);
  void (* CmdCpltCallback)      (struct __ESMC_HandleTypeDef *hesmc);
  void (* RxCpltCallback)       (struct __ESMC_HandleTypeDef *hesmc);
  void (* TxCpltCallback)       (struct __ESMC_HandleTypeDef *hesmc);
  void (* RxHalfCpltCallback)   (struct __ESMC_HandleTypeDef *hesmc);
  void (* TxHalfCpltCallback)   (struct __ESMC_HandleTypeDef *hesmc);
  void (* MspInitCallback)      (struct __ESMC_HandleTypeDef *hesmc);
  void (* MspDeInitCallback)    (struct __ESMC_HandleTypeDef *hesmc);
#endif
} ESMC_HandleTypeDef;

/**
  * @brief  ESMC Command structure definition
  */
typedef struct
{
  uint32_t TransferFormat;     /* Specifies the Transfer Format
                                  This parameter can be a value of @ref ESMC_TransferFormat */
  uint32_t Instruction;        /* Specifies the Instruction to be sent
                                  This parameter can be a value (8-bit) between 0x00 and 0xFF */
  uint32_t InstructionMode;    /* Specifies the Instruction Mode
                                  This parameter can be a value of @ref ESMC_InstructionMode */
  uint32_t Address;            /* Specifies the Address to be sent (Size from 1 to 4 bytes according AddressSize)
                                  This parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
  uint32_t AddressMode;        /* Specifies the Address Mode
                                  This parameter can be a value of @ref ESMC_AddressMode */
  uint32_t AddressSize;        /* Specifies the Address Size
                                  This parameter can be a value of @ref ESMC_AddressSize */
  uint32_t AlternateByte;      /* Specifies the Alternate Byte to be sent
                                  This parameter can be a value (8-bits) between 0x0 and 0xFF */
  uint32_t AlternateByteMode;  /* Specifies the Alternate Bytes Mode
                                  This parameter can be a value of @ref ESMC_AlternateBytesMode */
  uint32_t DataMode;           /* Specifies the Data Mode (used for dummy cycles and data phases)
                                  This parameter can be a value of @ref ESMC_DataMode */
  uint32_t NbData;             /* Specifies the number of data to transfer.
                                  This parameter can be any value between 1 and 0xFFFFFFFF */
  uint32_t DdrMode;            /* Specifies the double data rate mode for address, and data phase
                                  This parameter can be a value of @ref ESMC_DdrMode */
  uint32_t DummyCycles;        /* Specifies the Number of Dummy Cycles.
                                  This parameter can be a number between 0 and 31 */
  uint32_t CSPinSel;           /* Specifies the activated SSxO pin
                                  This parameter can be a value of @ref ESMC_CS_PIN_SEL */
} ESMC_CommandTypeDef;


#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL ESMC Callback ID enumeration definition
  */
typedef enum
{
  HAL_ESMC_ERROR_CB_ID          = 0x00U,  /*!< ESMC Error Callback ID            */
  HAL_ESMC_ABORT_CB_ID          = 0x01U,  /*!< ESMC Abort Callback ID            */
  HAL_ESMC_CMD_CPLT_CB_ID       = 0x02U,  /*!< ESMC Command Complete Callback ID */
  HAL_ESMC_RX_CPLT_CB_ID        = 0x03U,  /*!< ESMC Rx Complete Callback ID      */
  HAL_ESMC_TX_CPLT_CB_ID        = 0x04U,  /*!< ESMC Tx Complete Callback ID      */
  HAL_ESMC_RX_HALF_CPLT_CB_ID   = 0x05U,  /*!< ESMC Rx Half Complete Callback ID */
  HAL_ESMC_TX_HALF_CPLT_CB_ID   = 0x06U,  /*!< ESMC Tx Half Complete Callback ID */
  HAL_ESMC_MSP_INIT_CB_ID       = 0x07U,  /*!< ESMC MspInit Callback ID          */
  HAL_ESMC_MSP_DEINIT_CB_ID     = 0x08U   /*!< ESMC MspDeInit Callback ID        */
} HAL_ESMC_CallbackIDTypeDef;

/**
  * @brief  HAL ESMC Callback pointer definition
  */
typedef void (*pESMC_CallbackTypeDef)(ESMC_HandleTypeDef *hesmc);
#endif
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup ESMC_Exported_Constants ESMC Exported Constants
  * @{
  */

/** @defgroup ESMC_FIFO_SIZE ESMC FIFO SIZE
  * @{
  */
#define HAL_ESMC_TCR_MAX_LENGTH       0xFF
#define HAL_ESMC_FIFO_SIZE            0x80
/**
  * @}
  */
  
/** @defgroup ESMC_ErrorCode ESMC Error Code
  * @{
  */
#define HAL_ESMC_ERROR_NONE            ((uint32_t)0x00000000U) /*!< No error           */
#define HAL_ESMC_ERROR_TIMEOUT         ((uint32_t)0x00000001U) /*!< Timeout error      */
#define HAL_ESMC_ERROR_TRANSFER        ((uint32_t)0x00000002U) /*!< Transfer error     */
#define HAL_ESMC_ERROR_DMA             ((uint32_t)0x00000004U) /*!< DMA transfer error */
#define HAL_ESMC_ERROR_INVALID_PARAM   ((uint32_t)0x00000008U) /*!< Invalid parameters error */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
#define HAL_ESMC_ERROR_INVALID_CALLBACK 0x00000010U /*!< Invalid callback error   */
#endif
/**
  * @}
  */

/** @defgroup ESMC_CONTEXT ESMC CONTEXT
  * @{
  */
#define ESMC_CONTEXT_NONE                   ((uint32_t)0x00000000U)  /*!< None                             */
#define ESMC_CONTEXT_READ_FIXED_LENGTH      ((uint32_t)0x00000001U)  /*!< Read single block operation      */
#define ESMC_CONTEXT_READ_VARIABLE_LENGTH   ((uint32_t)0x00000002U)  /*!< Read multiple blocks operation   */
#define ESMC_CONTEXT_WRITE_FIXED_LENGTH     ((uint32_t)0x00000010U)  /*!< Write single block operation     */
#define ESMC_CONTEXT_WRITE_VARIABLE_LENGTH  ((uint32_t)0x00000020U)  /*!< Write multiple blocks operation  */
/**
  * @}
  */

//#define ESMC_FUNCTIONAL_MODE_INDIRECT_WRITE          ((uint32_t)0x0) /*!<Indirect read mode*/
//#define ESMC_FUNCTIONAL_MODE_INDIRECT_READ           ((uint32_t)0x1) /*!<Indirect read mode*/

/** @defgroup ESMC_ClockMode ESMC Clock Mode
  * @{
  */
#define ESMC_CLOCK_MODE_0                   ((uint32_t)0x00000000U)                     /*!<Clk stays low while nCS is released, the first data sampling is the first clock edge*/
#define ESMC_CLOCK_MODE_1                   ((uint32_t)(                ESMC_CR2_CPHA)) /*!<Clk stays low while nCS is released, the first data sampling is the second clock edge*/
#define ESMC_CLOCK_MODE_2                   ((uint32_t)(ESMC_CR2_CPOL                )) /*!<Clk goes high while nCS is released, the first data sampling is the first clock edge*/
#define ESMC_CLOCK_MODE_3                   ((uint32_t)(ESMC_CR2_CPOL | ESMC_CR2_CPHA)) /*!<Clk goes high while nCS is released, the first data sampling is the second clock edge*/
/**
  * @}
  */

/** @defgroup ESMC_TransferFormat ESMC Transfer Format
  * @{
  */
#define ESMC_TRANSFER_FORMAT_SINGLE         ((uint32_t)0x00000000U)                                    /*!<Transfer on a single line*/
#define ESMC_TRANSFER_FORMAT_DUAL           ((uint32_t)(ESMC_SOCR_SPIMODE_0))                          /*!<Transfer on two lines*/
#define ESMC_TRANSFER_FORMAT_QUAD           ((uint32_t)(ESMC_SOCR_SPIMODE_1))                          /*!<Transfer on four lines*/
#define ESMC_TRANSFER_FORMAT_OCTAL          ((uint32_t)(ESMC_SOCR_SPIMODE_0 | ESMC_SOCR_SPIMODE_1))    /*!<Transfer on eight lines*/
/**
  * @}
  */

